import streamlit as st



st.html(
    "<h2>         تبي وظيفة ؟؟         </h2>"
    "<p>معك عبدالله و انا حديث تخرج و ابحث عن و ظيفة مثلك  و اثناء البحث قليت ليش ما افهم سوق العمل عندنا في السعودية فرحت و حللت بيانات عن السوق فتعال معي وشوف سوق العمل عندنا كيف </p>"
)
st.html(
   "<h4>         اعلى منطقة في التوظيف         </h4>"
    "<p>في البداية لازم نعرف وين نبحث عن وظايف و هنا اعطيناك وش هي اعلى منطقة في الوظايف   </p>"
)
st.image("Q.1.png", width=1000)
st.html(
   
    "<p>و مثل ما تلاحظ عزيزي القارى ان الرياض هي اعلى منطقة و هذا يعطي افضلية لأهل الرياض في الوظايف   </p>"
)
st.html(
    "<h2>         مين تفضل الشركات       </h2>"
    "<p>هنا راح نشوف الشركات وش تفضل في التوظيف العيال او البنات </p>"
)
st.image("Q.2.png")
st.html(
    
    "<p>و مثل ما تشوف ما في فرق كبير في التفضيل و هذا يرجع لنوعية الوظيفة و مدى تناسبها  </p>"
)
st.html(
    "<h2>         كم رواتبنا  حنا يا حديثي التخرج؟       </h2>"
    "<p>هنا حسبت رواتب حديثي التخرج </p>"
)
st.image("Q.3.png")
st.html(
    "<h2>         نبي نشوف كم نسبة الطلب على حديثي التخرج مقابل ذوي الخبرة       </h2>"
  
)
st.image("Q.4.png")
st.html(
    
    "<p> و نلاحظ هنا ان الطلب على حديثي التخرج جيد جدا فالفرص موجودة    </p>"
)
st.html(
    "<h2>        متى توظف الشركات       </h2>"
  
)
st.image("Q.5.png")
st.image("Q.6.png")
st.html(
    
    "<p> وهنا نلاحظ ان اخر شهر في السنة هة اكبر شهر في التوظيف    </p>"
)
st.html(
    "<br>"
    "<br>"
    "<br>"
    "<p> وفي الختام هذا تحليل عن بيانات التوظيف في السعودية و نتمنى انه فادكم و قدم معلومات تساعد في البحث عن و ظيفة جيدة و مناسبة    </p>"
)
